GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Core/Inc/stm32f1xx_scb.h
/**
 * @file stm32f1xx_scb.h
 * @author Shrey Shah
 * @brief STM32F1 System Control Block Register-Layer Definitions
 * @version v1.1
 * @date 16-08-2026
 */

// Header Guards
#ifndef STM32F1XX_SCB_H_
#define STM32F1XX_SCB_H_

// ==================================================================================================== //
//												Includes												//
// ==================================================================================================== //
#include "stm32f1xx_utils.h"

// --- C++ Safeguards ---
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/**
 * @defgroup SCB System Control Block (SCB)
 * @ingroup STM32F1xx
 * @brief Cortex-M3 system exception, vector, fault, reset, sleep, and priority-group control
 * @details
 * This module owns the raw register fields and memory map of the Cortex-M3
 * System Control Block. NVIC priority code consumes
 * `SCB_AIRCR_PRIGROUP_Pos` and `SCB_AIRCR_PRIGROUP_Msk`, but AIRCR and every
 * `SCB_xxx` symbol remain SCB-owned.
 */

/**
 * @defgroup SCB_01_RegisterLayer SCB Register Layer
 * @ingroup SCB
 * @brief Raw Cortex-M3 SCB register fields and memory-mapped structure
 * @details
 * This layer owns hardware-visible SCB positions, masks, and register layout.
 * Higher layers may consume these symbols without transferring ownership.
 */

/**
 * @addtogroup SCB_01_RegisterLayer
 * @{
 */

// ==================================================================================================== //
//										SCB Register Defines											//
// ==================================================================================================== //

/**
 * @defgroup SCB_01_RegisterLayer_00_RegisterDefines SCB Register Field Definitions
 * @ingroup SCB_01_RegisterLayer
 * @brief Raw Cortex-M3 System Control Block register-field definitions
 * @details
 * Fields are grouped by owning hardware register and ordered from the least-
 * significant implemented bit toward the most-significant implemented bit.
 * Single-bit fields expose `_Pos`, `_Msk`, and an unsuffixed mask alias;
 * multi-bit fields additionally expose `_Width`. Existing `_Pos` and `_Msk`
 * identifiers remain available through this SCB-owned header.
 * @{
 */

// ---------------------------------------------------------------------------------------------------- //
//											SCB_CPUID											//
// ---------------------------------------------------------------------------------------------------- //
/** @brief Revision number (`SCB_CPUID.REVISION[3:0]`) field position @def SCB_CPUID_REVISION_Pos */
#define SCB_CPUID_REVISION_Pos			((reg_bit_pos_t) 0U)
/** @brief Revision number (`SCB_CPUID.REVISION[3:0]`) field width @def SCB_CPUID_REVISION_Width */
#define SCB_CPUID_REVISION_Width		((reg_field_width_t) 4U)
/** @brief Revision number (`SCB_CPUID.REVISION[3:0]`) field mask @def SCB_CPUID_REVISION_Msk */
#define SCB_CPUID_REVISION_Msk			REG_FIELD_MASK(SCB_CPUID_REVISION_Pos, SCB_CPUID_REVISION_Width)
/** @brief Revision number (`SCB_CPUID.REVISION[3:0]`) field mask alias @def SCB_CPUID_REVISION */
#define SCB_CPUID_REVISION			SCB_CPUID_REVISION_Msk

/** @brief Processor part number (`SCB_CPUID.PARTNO[15:4]`) field position @def SCB_CPUID_PARTNO_Pos */
#define SCB_CPUID_PARTNO_Pos			((reg_bit_pos_t) 4U)
/** @brief Processor part number (`SCB_CPUID.PARTNO[15:4]`) field width @def SCB_CPUID_PARTNO_Width */
#define SCB_CPUID_PARTNO_Width			((reg_field_width_t) 12U)
/** @brief Processor part number (`SCB_CPUID.PARTNO[15:4]`) field mask @def SCB_CPUID_PARTNO_Msk */
#define SCB_CPUID_PARTNO_Msk			REG_FIELD_MASK(SCB_CPUID_PARTNO_Pos, SCB_CPUID_PARTNO_Width)
/** @brief Processor part number (`SCB_CPUID.PARTNO[15:4]`) field mask alias @def SCB_CPUID_PARTNO */
#define SCB_CPUID_PARTNO			SCB_CPUID_PARTNO_Msk

/** @brief Architecture identifier (`SCB_CPUID.ARCHITECTURE[19:16]`) field position @def SCB_CPUID_ARCHITECTURE_Pos */
#define SCB_CPUID_ARCHITECTURE_Pos		((reg_bit_pos_t) 16U)
/** @brief Architecture identifier (`SCB_CPUID.ARCHITECTURE[19:16]`) field width @def SCB_CPUID_ARCHITECTURE_Width */
#define SCB_CPUID_ARCHITECTURE_Width		((reg_field_width_t) 4U)
/** @brief Architecture identifier (`SCB_CPUID.ARCHITECTURE[19:16]`) field mask @def SCB_CPUID_ARCHITECTURE_Msk */
#define SCB_CPUID_ARCHITECTURE_Msk		REG_FIELD_MASK(SCB_CPUID_ARCHITECTURE_Pos, SCB_CPUID_ARCHITECTURE_Width)
/** @brief Architecture identifier (`SCB_CPUID.ARCHITECTURE[19:16]`) field mask alias @def SCB_CPUID_ARCHITECTURE */
#define SCB_CPUID_ARCHITECTURE			SCB_CPUID_ARCHITECTURE_Msk

/** @brief Processor variant number (`SCB_CPUID.VARIANT[23:20]`) field position @def SCB_CPUID_VARIANT_Pos */
#define SCB_CPUID_VARIANT_Pos			((reg_bit_pos_t) 20U)
/** @brief Processor variant number (`SCB_CPUID.VARIANT[23:20]`) field width @def SCB_CPUID_VARIANT_Width */
#define SCB_CPUID_VARIANT_Width			((reg_field_width_t) 4U)
/** @brief Processor variant number (`SCB_CPUID.VARIANT[23:20]`) field mask @def SCB_CPUID_VARIANT_Msk */
#define SCB_CPUID_VARIANT_Msk			REG_FIELD_MASK(SCB_CPUID_VARIANT_Pos, SCB_CPUID_VARIANT_Width)
/** @brief Processor variant number (`SCB_CPUID.VARIANT[23:20]`) field mask alias @def SCB_CPUID_VARIANT */
#define SCB_CPUID_VARIANT			SCB_CPUID_VARIANT_Msk

/** @brief Implementer identifier (`SCB_CPUID.IMPLEMENTER[31:24]`) field position @def SCB_CPUID_IMPLEMENTER_Pos */
#define SCB_CPUID_IMPLEMENTER_Pos		((reg_bit_pos_t) 24U)
/** @brief Implementer identifier (`SCB_CPUID.IMPLEMENTER[31:24]`) field width @def SCB_CPUID_IMPLEMENTER_Width */
#define SCB_CPUID_IMPLEMENTER_Width		((reg_field_width_t) 8U)
/** @brief Implementer identifier (`SCB_CPUID.IMPLEMENTER[31:24]`) field mask @def SCB_CPUID_IMPLEMENTER_Msk */
#define SCB_CPUID_IMPLEMENTER_Msk		REG_FIELD_MASK(SCB_CPUID_IMPLEMENTER_Pos, SCB_CPUID_IMPLEMENTER_Width)
/** @brief Implementer identifier (`SCB_CPUID.IMPLEMENTER[31:24]`) field mask alias @def SCB_CPUID_IMPLEMENTER */
#define SCB_CPUID_IMPLEMENTER			SCB_CPUID_IMPLEMENTER_Msk

// ---------------------------------------------------------------------------------------------------- //
//											SCB_ICSR											//
// ---------------------------------------------------------------------------------------------------- //
/** @brief Active exception number (`SCB_ICSR.VECTACTIVE[8:0]`) field position @def SCB_ICSR_VECTACTIVE_Pos */
#define SCB_ICSR_VECTACTIVE_Pos			((reg_bit_pos_t) 0U)
/** @brief Active exception number (`SCB_ICSR.VECTACTIVE[8:0]`) field width @def SCB_ICSR_VECTACTIVE_Width */
#define SCB_ICSR_VECTACTIVE_Width		((reg_field_width_t) 9U)
/** @brief Active exception number (`SCB_ICSR.VECTACTIVE[8:0]`) field mask @def SCB_ICSR_VECTACTIVE_Msk */
#define SCB_ICSR_VECTACTIVE_Msk			REG_FIELD_MASK(SCB_ICSR_VECTACTIVE_Pos, SCB_ICSR_VECTACTIVE_Width)
/** @brief Active exception number (`SCB_ICSR.VECTACTIVE[8:0]`) field mask alias @def SCB_ICSR_VECTACTIVE */
#define SCB_ICSR_VECTACTIVE			SCB_ICSR_VECTACTIVE_Msk

/** @brief Return-to-base state (`SCB_ICSR.RETTOBASE`) bit position @def SCB_ICSR_RETTOBASE_Pos */
#define SCB_ICSR_RETTOBASE_Pos			((reg_bit_pos_t) 11U)
/** @brief Return-to-base state (`SCB_ICSR.RETTOBASE`) bit mask @def SCB_ICSR_RETTOBASE_Msk */
#define SCB_ICSR_RETTOBASE_Msk			REG_BIT_MASK(SCB_ICSR_RETTOBASE_Pos)
/** @brief Return-to-base state (`SCB_ICSR.RETTOBASE`) bit mask alias @def SCB_ICSR_RETTOBASE */
#define SCB_ICSR_RETTOBASE			SCB_ICSR_RETTOBASE_Msk

/** @brief Highest-priority pending exception number (`SCB_ICSR.VECTPENDING[20:12]`) field position @def SCB_ICSR_VECTPENDING_Pos */
#define SCB_ICSR_VECTPENDING_Pos		((reg_bit_pos_t) 12U)
/** @brief Highest-priority pending exception number (`SCB_ICSR.VECTPENDING[20:12]`) field width @def SCB_ICSR_VECTPENDING_Width */
#define SCB_ICSR_VECTPENDING_Width		((reg_field_width_t) 9U)
/** @brief Highest-priority pending exception number (`SCB_ICSR.VECTPENDING[20:12]`) field mask @def SCB_ICSR_VECTPENDING_Msk */
#define SCB_ICSR_VECTPENDING_Msk		REG_FIELD_MASK(SCB_ICSR_VECTPENDING_Pos, SCB_ICSR_VECTPENDING_Width)
/** @brief Highest-priority pending exception number (`SCB_ICSR.VECTPENDING[20:12]`) field mask alias @def SCB_ICSR_VECTPENDING */
#define SCB_ICSR_VECTPENDING			SCB_ICSR_VECTPENDING_Msk

/** @brief External interrupt pending state (`SCB_ICSR.ISRPENDING`) bit position @def SCB_ICSR_ISRPENDING_Pos */
#define SCB_ICSR_ISRPENDING_Pos			((reg_bit_pos_t) 22U)
/** @brief External interrupt pending state (`SCB_ICSR.ISRPENDING`) bit mask @def SCB_ICSR_ISRPENDING_Msk */
#define SCB_ICSR_ISRPENDING_Msk			REG_BIT_MASK(SCB_ICSR_ISRPENDING_Pos)
/** @brief External interrupt pending state (`SCB_ICSR.ISRPENDING`) bit mask alias @def SCB_ICSR_ISRPENDING */
#define SCB_ICSR_ISRPENDING			SCB_ICSR_ISRPENDING_Msk

/** @brief Pending interrupt preemption state (`SCB_ICSR.ISRPREEMPT`) bit position @def SCB_ICSR_ISRPREEMPT_Pos */
#define SCB_ICSR_ISRPREEMPT_Pos			((reg_bit_pos_t) 23U)
/** @brief Pending interrupt preemption state (`SCB_ICSR.ISRPREEMPT`) bit mask @def SCB_ICSR_ISRPREEMPT_Msk */
#define SCB_ICSR_ISRPREEMPT_Msk			REG_BIT_MASK(SCB_ICSR_ISRPREEMPT_Pos)
/** @brief Pending interrupt preemption state (`SCB_ICSR.ISRPREEMPT`) bit mask alias @def SCB_ICSR_ISRPREEMPT */
#define SCB_ICSR_ISRPREEMPT			SCB_ICSR_ISRPREEMPT_Msk

/** @brief SysTick pending-clear action (`SCB_ICSR.PENDSTCLR`) bit position @def SCB_ICSR_PENDSTCLR_Pos */
#define SCB_ICSR_PENDSTCLR_Pos			((reg_bit_pos_t) 25U)
/** @brief SysTick pending-clear action (`SCB_ICSR.PENDSTCLR`) bit mask @def SCB_ICSR_PENDSTCLR_Msk */
#define SCB_ICSR_PENDSTCLR_Msk			REG_BIT_MASK(SCB_ICSR_PENDSTCLR_Pos)
/** @brief SysTick pending-clear action (`SCB_ICSR.PENDSTCLR`) bit mask alias @def SCB_ICSR_PENDSTCLR */
#define SCB_ICSR_PENDSTCLR			SCB_ICSR_PENDSTCLR_Msk

/** @brief SysTick pending-set state and action (`SCB_ICSR.PENDSTSET`) bit position @def SCB_ICSR_PENDSTSET_Pos */
#define SCB_ICSR_PENDSTSET_Pos			((reg_bit_pos_t) 26U)
/** @brief SysTick pending-set state and action (`SCB_ICSR.PENDSTSET`) bit mask @def SCB_ICSR_PENDSTSET_Msk */
#define SCB_ICSR_PENDSTSET_Msk			REG_BIT_MASK(SCB_ICSR_PENDSTSET_Pos)
/** @brief SysTick pending-set state and action (`SCB_ICSR.PENDSTSET`) bit mask alias @def SCB_ICSR_PENDSTSET */
#define SCB_ICSR_PENDSTSET			SCB_ICSR_PENDSTSET_Msk

/** @brief PendSV pending-clear action (`SCB_ICSR.PENDSVCLR`) bit position @def SCB_ICSR_PENDSVCLR_Pos */
#define SCB_ICSR_PENDSVCLR_Pos			((reg_bit_pos_t) 27U)
/** @brief PendSV pending-clear action (`SCB_ICSR.PENDSVCLR`) bit mask @def SCB_ICSR_PENDSVCLR_Msk */
#define SCB_ICSR_PENDSVCLR_Msk			REG_BIT_MASK(SCB_ICSR_PENDSVCLR_Pos)
/** @brief PendSV pending-clear action (`SCB_ICSR.PENDSVCLR`) bit mask alias @def SCB_ICSR_PENDSVCLR */
#define SCB_ICSR_PENDSVCLR			SCB_ICSR_PENDSVCLR_Msk

/** @brief PendSV pending-set state and action (`SCB_ICSR.PENDSVSET`) bit position @def SCB_ICSR_PENDSVSET_Pos */
#define SCB_ICSR_PENDSVSET_Pos			((reg_bit_pos_t) 28U)
/** @brief PendSV pending-set state and action (`SCB_ICSR.PENDSVSET`) bit mask @def SCB_ICSR_PENDSVSET_Msk */
#define SCB_ICSR_PENDSVSET_Msk			REG_BIT_MASK(SCB_ICSR_PENDSVSET_Pos)
/** @brief PendSV pending-set state and action (`SCB_ICSR.PENDSVSET`) bit mask alias @def SCB_ICSR_PENDSVSET */
#define SCB_ICSR_PENDSVSET			SCB_ICSR_PENDSVSET_Msk

/** @brief NMI pending-set state and action (`SCB_ICSR.NMIPENDSET`) bit position @def SCB_ICSR_NMIPENDSET_Pos */
#define SCB_ICSR_NMIPENDSET_Pos			((reg_bit_pos_t) 31U)
/** @brief NMI pending-set state and action (`SCB_ICSR.NMIPENDSET`) bit mask @def SCB_ICSR_NMIPENDSET_Msk */
#define SCB_ICSR_NMIPENDSET_Msk			REG_BIT_MASK(SCB_ICSR_NMIPENDSET_Pos)
/** @brief NMI pending-set state and action (`SCB_ICSR.NMIPENDSET`) bit mask alias @def SCB_ICSR_NMIPENDSET */
#define SCB_ICSR_NMIPENDSET			SCB_ICSR_NMIPENDSET_Msk

// ---------------------------------------------------------------------------------------------------- //
//											SCB_VTOR											//
// ---------------------------------------------------------------------------------------------------- //
#if !defined(__CM3_REV) || (__CM3_REV < 0x0201U)
/** @brief Vector table offset (`SCB_VTOR.TBLOFF[28:7]`) field position @def SCB_VTOR_TBLOFF_Pos */
#define SCB_VTOR_TBLOFF_Pos		((reg_bit_pos_t) 7U)
/** @brief Vector table offset (`SCB_VTOR.TBLOFF[28:7]`) field width @def SCB_VTOR_TBLOFF_Width */
#define SCB_VTOR_TBLOFF_Width		((reg_field_width_t) 22U)
/** @brief Vector table offset (`SCB_VTOR.TBLOFF[28:7]`) field mask @def SCB_VTOR_TBLOFF_Msk */
#define SCB_VTOR_TBLOFF_Msk		REG_FIELD_MASK(SCB_VTOR_TBLOFF_Pos, SCB_VTOR_TBLOFF_Width)
/** @brief Vector table offset (`SCB_VTOR.TBLOFF[28:7]`) field mask alias @def SCB_VTOR_TBLOFF */
#define SCB_VTOR_TBLOFF			SCB_VTOR_TBLOFF_Msk

