GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Core/Inc/stm32f1xx_scb.h
/** @brief Vector table memory-region selection (`SCB_VTOR.TBLBASE`) bit position @def SCB_VTOR_TBLBASE_Pos */
#define SCB_VTOR_TBLBASE_Pos		((reg_bit_pos_t) 29U)
/** @brief Vector table memory-region selection (`SCB_VTOR.TBLBASE`) bit mask @def SCB_VTOR_TBLBASE_Msk */
#define SCB_VTOR_TBLBASE_Msk		REG_BIT_MASK(SCB_VTOR_TBLBASE_Pos)
/** @brief Vector table memory-region selection (`SCB_VTOR.TBLBASE`) bit mask alias @def SCB_VTOR_TBLBASE */
#define SCB_VTOR_TBLBASE		SCB_VTOR_TBLBASE_Msk
#else
/** @brief Vector table offset (`SCB_VTOR.TBLOFF[31:7]`) field position @def SCB_VTOR_TBLOFF_Pos */
#define SCB_VTOR_TBLOFF_Pos		((reg_bit_pos_t) 7U)
/** @brief Vector table offset (`SCB_VTOR.TBLOFF[31:7]`) field width @def SCB_VTOR_TBLOFF_Width */
#define SCB_VTOR_TBLOFF_Width		((reg_field_width_t) 25U)
/** @brief Vector table offset (`SCB_VTOR.TBLOFF[31:7]`) field mask @def SCB_VTOR_TBLOFF_Msk */
#define SCB_VTOR_TBLOFF_Msk		REG_FIELD_MASK(SCB_VTOR_TBLOFF_Pos, SCB_VTOR_TBLOFF_Width)
/** @brief Vector table offset (`SCB_VTOR.TBLOFF[31:7]`) field mask alias @def SCB_VTOR_TBLOFF */
#define SCB_VTOR_TBLOFF			SCB_VTOR_TBLOFF_Msk
#endif /* !defined(__CM3_REV) || (__CM3_REV < 0x0201U) */

// ---------------------------------------------------------------------------------------------------- //
//											SCB_AIRCR											//
// ---------------------------------------------------------------------------------------------------- //
/** @brief Local system-reset request (`SCB_AIRCR.VECTRESET`) bit position @def SCB_AIRCR_VECTRESET_Pos */
#define SCB_AIRCR_VECTRESET_Pos			((reg_bit_pos_t) 0U)
/** @brief Local system-reset request (`SCB_AIRCR.VECTRESET`) bit mask @def SCB_AIRCR_VECTRESET_Msk */
#define SCB_AIRCR_VECTRESET_Msk			REG_BIT_MASK(SCB_AIRCR_VECTRESET_Pos)
/** @brief Local system-reset request (`SCB_AIRCR.VECTRESET`) bit mask alias @def SCB_AIRCR_VECTRESET */
#define SCB_AIRCR_VECTRESET			SCB_AIRCR_VECTRESET_Msk

/** @brief Active exception-state clear request (`SCB_AIRCR.VECTCLRACTIVE`) bit position @def SCB_AIRCR_VECTCLRACTIVE_Pos */
#define SCB_AIRCR_VECTCLRACTIVE_Pos		((reg_bit_pos_t) 1U)
/** @brief Active exception-state clear request (`SCB_AIRCR.VECTCLRACTIVE`) bit mask @def SCB_AIRCR_VECTCLRACTIVE_Msk */
#define SCB_AIRCR_VECTCLRACTIVE_Msk		REG_BIT_MASK(SCB_AIRCR_VECTCLRACTIVE_Pos)
/** @brief Active exception-state clear request (`SCB_AIRCR.VECTCLRACTIVE`) bit mask alias @def SCB_AIRCR_VECTCLRACTIVE */
#define SCB_AIRCR_VECTCLRACTIVE			SCB_AIRCR_VECTCLRACTIVE_Msk

/** @brief System-reset request (`SCB_AIRCR.SYSRESETREQ`) bit position @def SCB_AIRCR_SYSRESETREQ_Pos */
#define SCB_AIRCR_SYSRESETREQ_Pos		((reg_bit_pos_t) 2U)
/** @brief System-reset request (`SCB_AIRCR.SYSRESETREQ`) bit mask @def SCB_AIRCR_SYSRESETREQ_Msk */
#define SCB_AIRCR_SYSRESETREQ_Msk		REG_BIT_MASK(SCB_AIRCR_SYSRESETREQ_Pos)
/** @brief System-reset request (`SCB_AIRCR.SYSRESETREQ`) bit mask alias @def SCB_AIRCR_SYSRESETREQ */
#define SCB_AIRCR_SYSRESETREQ			SCB_AIRCR_SYSRESETREQ_Msk

/** @brief Priority grouping selection (`SCB_AIRCR.PRIGROUP[10:8]`) field position @def SCB_AIRCR_PRIGROUP_Pos */
#define SCB_AIRCR_PRIGROUP_Pos			((reg_bit_pos_t) 8U)
/** @brief Priority grouping selection (`SCB_AIRCR.PRIGROUP[10:8]`) field width @def SCB_AIRCR_PRIGROUP_Width */
#define SCB_AIRCR_PRIGROUP_Width		((reg_field_width_t) 3U)
/** @brief Priority grouping selection (`SCB_AIRCR.PRIGROUP[10:8]`) field mask @def SCB_AIRCR_PRIGROUP_Msk */
#define SCB_AIRCR_PRIGROUP_Msk			REG_FIELD_MASK(SCB_AIRCR_PRIGROUP_Pos, SCB_AIRCR_PRIGROUP_Width)
/** @brief Priority grouping selection (`SCB_AIRCR.PRIGROUP[10:8]`) field mask alias @def SCB_AIRCR_PRIGROUP */
#define SCB_AIRCR_PRIGROUP			SCB_AIRCR_PRIGROUP_Msk

/** @brief Data endianness state (`SCB_AIRCR.ENDIANESS`) bit position @def SCB_AIRCR_ENDIANESS_Pos */
#define SCB_AIRCR_ENDIANESS_Pos			((reg_bit_pos_t) 15U)
/** @brief Data endianness state (`SCB_AIRCR.ENDIANESS`) bit mask @def SCB_AIRCR_ENDIANESS_Msk */
#define SCB_AIRCR_ENDIANESS_Msk			REG_BIT_MASK(SCB_AIRCR_ENDIANESS_Pos)
/** @brief Data endianness state (`SCB_AIRCR.ENDIANESS`) bit mask alias @def SCB_AIRCR_ENDIANESS */
#define SCB_AIRCR_ENDIANESS			SCB_AIRCR_ENDIANESS_Msk

/** @brief Write access key (`SCB_AIRCR.VECTKEY[31:16]`) field position @def SCB_AIRCR_VECTKEY_Pos */
#define SCB_AIRCR_VECTKEY_Pos			((reg_bit_pos_t) 16U)
/** @brief Write access key (`SCB_AIRCR.VECTKEY[31:16]`) field width @def SCB_AIRCR_VECTKEY_Width */
#define SCB_AIRCR_VECTKEY_Width			((reg_field_width_t) 16U)
/** @brief Write access key (`SCB_AIRCR.VECTKEY[31:16]`) field mask @def SCB_AIRCR_VECTKEY_Msk */
#define SCB_AIRCR_VECTKEY_Msk			REG_FIELD_MASK(SCB_AIRCR_VECTKEY_Pos, SCB_AIRCR_VECTKEY_Width)
/** @brief Write access key (`SCB_AIRCR.VECTKEY[31:16]`) field mask alias @def SCB_AIRCR_VECTKEY */
#define SCB_AIRCR_VECTKEY			SCB_AIRCR_VECTKEY_Msk

/** @brief Read-side access-key status (`SCB_AIRCR.VECTKEYSTAT[31:16]`) field position @def SCB_AIRCR_VECTKEYSTAT_Pos */
#define SCB_AIRCR_VECTKEYSTAT_Pos		((reg_bit_pos_t) 16U)
/** @brief Read-side access-key status (`SCB_AIRCR.VECTKEYSTAT[31:16]`) field width @def SCB_AIRCR_VECTKEYSTAT_Width */
#define SCB_AIRCR_VECTKEYSTAT_Width		((reg_field_width_t) 16U)
/** @brief Read-side access-key status (`SCB_AIRCR.VECTKEYSTAT[31:16]`) field mask @def SCB_AIRCR_VECTKEYSTAT_Msk */
#define SCB_AIRCR_VECTKEYSTAT_Msk		REG_FIELD_MASK(SCB_AIRCR_VECTKEYSTAT_Pos, SCB_AIRCR_VECTKEYSTAT_Width)
/** @brief Read-side access-key status (`SCB_AIRCR.VECTKEYSTAT[31:16]`) field mask alias @def SCB_AIRCR_VECTKEYSTAT */
#define SCB_AIRCR_VECTKEYSTAT			SCB_AIRCR_VECTKEYSTAT_Msk

// ---------------------------------------------------------------------------------------------------- //
//											SCB_SCR											//
// ---------------------------------------------------------------------------------------------------- //
/** @brief Sleep-on-exception-return control (`SCB_SCR.SLEEPONEXIT`) bit position @def SCB_SCR_SLEEPONEXIT_Pos */
#define SCB_SCR_SLEEPONEXIT_Pos		((reg_bit_pos_t) 1U)
/** @brief Sleep-on-exception-return control (`SCB_SCR.SLEEPONEXIT`) bit mask @def SCB_SCR_SLEEPONEXIT_Msk */
#define SCB_SCR_SLEEPONEXIT_Msk		REG_BIT_MASK(SCB_SCR_SLEEPONEXIT_Pos)
/** @brief Sleep-on-exception-return control (`SCB_SCR.SLEEPONEXIT`) bit mask alias @def SCB_SCR_SLEEPONEXIT */
#define SCB_SCR_SLEEPONEXIT		SCB_SCR_SLEEPONEXIT_Msk

/** @brief Deep-sleep selection (`SCB_SCR.SLEEPDEEP`) bit position @def SCB_SCR_SLEEPDEEP_Pos */
#define SCB_SCR_SLEEPDEEP_Pos		((reg_bit_pos_t) 2U)
/** @brief Deep-sleep selection (`SCB_SCR.SLEEPDEEP`) bit mask @def SCB_SCR_SLEEPDEEP_Msk */
#define SCB_SCR_SLEEPDEEP_Msk		REG_BIT_MASK(SCB_SCR_SLEEPDEEP_Pos)
/** @brief Deep-sleep selection (`SCB_SCR.SLEEPDEEP`) bit mask alias @def SCB_SCR_SLEEPDEEP */
#define SCB_SCR_SLEEPDEEP		SCB_SCR_SLEEPDEEP_Msk

/** @brief Send-event-on-pend control (`SCB_SCR.SEVONPEND`) bit position @def SCB_SCR_SEVONPEND_Pos */
#define SCB_SCR_SEVONPEND_Pos		((reg_bit_pos_t) 4U)
/** @brief Send-event-on-pend control (`SCB_SCR.SEVONPEND`) bit mask @def SCB_SCR_SEVONPEND_Msk */
#define SCB_SCR_SEVONPEND_Msk		REG_BIT_MASK(SCB_SCR_SEVONPEND_Pos)
/** @brief Send-event-on-pend control (`SCB_SCR.SEVONPEND`) bit mask alias @def SCB_SCR_SEVONPEND */
#define SCB_SCR_SEVONPEND		SCB_SCR_SEVONPEND_Msk

// ---------------------------------------------------------------------------------------------------- //
//											SCB_CCR											//
// ---------------------------------------------------------------------------------------------------- //
/** @brief Non-base thread-mode enable (`SCB_CCR.NONBASETHRDENA`) bit position @def SCB_CCR_NONBASETHRDENA_Pos */
#define SCB_CCR_NONBASETHRDENA_Pos		((reg_bit_pos_t) 0U)
/** @brief Non-base thread-mode enable (`SCB_CCR.NONBASETHRDENA`) bit mask @def SCB_CCR_NONBASETHRDENA_Msk */
#define SCB_CCR_NONBASETHRDENA_Msk		REG_BIT_MASK(SCB_CCR_NONBASETHRDENA_Pos)
/** @brief Non-base thread-mode enable (`SCB_CCR.NONBASETHRDENA`) bit mask alias @def SCB_CCR_NONBASETHRDENA */
#define SCB_CCR_NONBASETHRDENA			SCB_CCR_NONBASETHRDENA_Msk

/** @brief Unprivileged software-trigger enable (`SCB_CCR.USERSETMPEND`) bit position @def SCB_CCR_USERSETMPEND_Pos */
#define SCB_CCR_USERSETMPEND_Pos		((reg_bit_pos_t) 1U)
/** @brief Unprivileged software-trigger enable (`SCB_CCR.USERSETMPEND`) bit mask @def SCB_CCR_USERSETMPEND_Msk */
#define SCB_CCR_USERSETMPEND_Msk		REG_BIT_MASK(SCB_CCR_USERSETMPEND_Pos)
/** @brief Unprivileged software-trigger enable (`SCB_CCR.USERSETMPEND`) bit mask alias @def SCB_CCR_USERSETMPEND */
#define SCB_CCR_USERSETMPEND			SCB_CCR_USERSETMPEND_Msk

