GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Core/Inc/stm32f1xx_scb.h
/** @brief Unaligned-access trap enable (`SCB_CCR.UNALIGN_TRP`) bit position @def SCB_CCR_UNALIGN_TRP_Pos */
#define SCB_CCR_UNALIGN_TRP_Pos			((reg_bit_pos_t) 3U)
/** @brief Unaligned-access trap enable (`SCB_CCR.UNALIGN_TRP`) bit mask @def SCB_CCR_UNALIGN_TRP_Msk */
#define SCB_CCR_UNALIGN_TRP_Msk			REG_BIT_MASK(SCB_CCR_UNALIGN_TRP_Pos)
/** @brief Unaligned-access trap enable (`SCB_CCR.UNALIGN_TRP`) bit mask alias @def SCB_CCR_UNALIGN_TRP */
#define SCB_CCR_UNALIGN_TRP			SCB_CCR_UNALIGN_TRP_Msk

/** @brief Divide-by-zero trap enable (`SCB_CCR.DIV_0_TRP`) bit position @def SCB_CCR_DIV_0_TRP_Pos */
#define SCB_CCR_DIV_0_TRP_Pos			((reg_bit_pos_t) 4U)
/** @brief Divide-by-zero trap enable (`SCB_CCR.DIV_0_TRP`) bit mask @def SCB_CCR_DIV_0_TRP_Msk */
#define SCB_CCR_DIV_0_TRP_Msk			REG_BIT_MASK(SCB_CCR_DIV_0_TRP_Pos)
/** @brief Divide-by-zero trap enable (`SCB_CCR.DIV_0_TRP`) bit mask alias @def SCB_CCR_DIV_0_TRP */
#define SCB_CCR_DIV_0_TRP			SCB_CCR_DIV_0_TRP_Msk

/** @brief Bus-fault ignore control for HardFault and NMI (`SCB_CCR.BFHFNMIGN`) bit position @def SCB_CCR_BFHFNMIGN_Pos */
#define SCB_CCR_BFHFNMIGN_Pos			((reg_bit_pos_t) 8U)
/** @brief Bus-fault ignore control for HardFault and NMI (`SCB_CCR.BFHFNMIGN`) bit mask @def SCB_CCR_BFHFNMIGN_Msk */
#define SCB_CCR_BFHFNMIGN_Msk			REG_BIT_MASK(SCB_CCR_BFHFNMIGN_Pos)
/** @brief Bus-fault ignore control for HardFault and NMI (`SCB_CCR.BFHFNMIGN`) bit mask alias @def SCB_CCR_BFHFNMIGN */
#define SCB_CCR_BFHFNMIGN			SCB_CCR_BFHFNMIGN_Msk

/** @brief Exception stack-alignment selection (`SCB_CCR.STKALIGN`) bit position @def SCB_CCR_STKALIGN_Pos */
#define SCB_CCR_STKALIGN_Pos			((reg_bit_pos_t) 9U)
/** @brief Exception stack-alignment selection (`SCB_CCR.STKALIGN`) bit mask @def SCB_CCR_STKALIGN_Msk */
#define SCB_CCR_STKALIGN_Msk			REG_BIT_MASK(SCB_CCR_STKALIGN_Pos)
/** @brief Exception stack-alignment selection (`SCB_CCR.STKALIGN`) bit mask alias @def SCB_CCR_STKALIGN */
#define SCB_CCR_STKALIGN			SCB_CCR_STKALIGN_Msk

// ---------------------------------------------------------------------------------------------------- //
//											SCB_SHCSR											//
// ---------------------------------------------------------------------------------------------------- //
/** @brief MemManage fault active state (`SCB_SHCSR.MEMFAULTACT`) bit position @def SCB_SHCSR_MEMFAULTACT_Pos */
#define SCB_SHCSR_MEMFAULTACT_Pos		((reg_bit_pos_t) 0U)
/** @brief MemManage fault active state (`SCB_SHCSR.MEMFAULTACT`) bit mask @def SCB_SHCSR_MEMFAULTACT_Msk */
#define SCB_SHCSR_MEMFAULTACT_Msk		REG_BIT_MASK(SCB_SHCSR_MEMFAULTACT_Pos)
/** @brief MemManage fault active state (`SCB_SHCSR.MEMFAULTACT`) bit mask alias @def SCB_SHCSR_MEMFAULTACT */
#define SCB_SHCSR_MEMFAULTACT			SCB_SHCSR_MEMFAULTACT_Msk

/** @brief BusFault active state (`SCB_SHCSR.BUSFAULTACT`) bit position @def SCB_SHCSR_BUSFAULTACT_Pos */
#define SCB_SHCSR_BUSFAULTACT_Pos		((reg_bit_pos_t) 1U)
/** @brief BusFault active state (`SCB_SHCSR.BUSFAULTACT`) bit mask @def SCB_SHCSR_BUSFAULTACT_Msk */
#define SCB_SHCSR_BUSFAULTACT_Msk		REG_BIT_MASK(SCB_SHCSR_BUSFAULTACT_Pos)
/** @brief BusFault active state (`SCB_SHCSR.BUSFAULTACT`) bit mask alias @def SCB_SHCSR_BUSFAULTACT */
#define SCB_SHCSR_BUSFAULTACT			SCB_SHCSR_BUSFAULTACT_Msk

/** @brief UsageFault active state (`SCB_SHCSR.USGFAULTACT`) bit position @def SCB_SHCSR_USGFAULTACT_Pos */
#define SCB_SHCSR_USGFAULTACT_Pos		((reg_bit_pos_t) 3U)
/** @brief UsageFault active state (`SCB_SHCSR.USGFAULTACT`) bit mask @def SCB_SHCSR_USGFAULTACT_Msk */
#define SCB_SHCSR_USGFAULTACT_Msk		REG_BIT_MASK(SCB_SHCSR_USGFAULTACT_Pos)
/** @brief UsageFault active state (`SCB_SHCSR.USGFAULTACT`) bit mask alias @def SCB_SHCSR_USGFAULTACT */
#define SCB_SHCSR_USGFAULTACT			SCB_SHCSR_USGFAULTACT_Msk

/** @brief SVCall active state (`SCB_SHCSR.SVCALLACT`) bit position @def SCB_SHCSR_SVCALLACT_Pos */
#define SCB_SHCSR_SVCALLACT_Pos			((reg_bit_pos_t) 7U)
/** @brief SVCall active state (`SCB_SHCSR.SVCALLACT`) bit mask @def SCB_SHCSR_SVCALLACT_Msk */
#define SCB_SHCSR_SVCALLACT_Msk			REG_BIT_MASK(SCB_SHCSR_SVCALLACT_Pos)
/** @brief SVCall active state (`SCB_SHCSR.SVCALLACT`) bit mask alias @def SCB_SHCSR_SVCALLACT */
#define SCB_SHCSR_SVCALLACT			SCB_SHCSR_SVCALLACT_Msk

/** @brief DebugMonitor active state (`SCB_SHCSR.MONITORACT`) bit position @def SCB_SHCSR_MONITORACT_Pos */
#define SCB_SHCSR_MONITORACT_Pos		((reg_bit_pos_t) 8U)
/** @brief DebugMonitor active state (`SCB_SHCSR.MONITORACT`) bit mask @def SCB_SHCSR_MONITORACT_Msk */
#define SCB_SHCSR_MONITORACT_Msk		REG_BIT_MASK(SCB_SHCSR_MONITORACT_Pos)
/** @brief DebugMonitor active state (`SCB_SHCSR.MONITORACT`) bit mask alias @def SCB_SHCSR_MONITORACT */
#define SCB_SHCSR_MONITORACT			SCB_SHCSR_MONITORACT_Msk

/** @brief PendSV active state (`SCB_SHCSR.PENDSVACT`) bit position @def SCB_SHCSR_PENDSVACT_Pos */
#define SCB_SHCSR_PENDSVACT_Pos			((reg_bit_pos_t) 10U)
/** @brief PendSV active state (`SCB_SHCSR.PENDSVACT`) bit mask @def SCB_SHCSR_PENDSVACT_Msk */
#define SCB_SHCSR_PENDSVACT_Msk			REG_BIT_MASK(SCB_SHCSR_PENDSVACT_Pos)
/** @brief PendSV active state (`SCB_SHCSR.PENDSVACT`) bit mask alias @def SCB_SHCSR_PENDSVACT */
#define SCB_SHCSR_PENDSVACT			SCB_SHCSR_PENDSVACT_Msk

/** @brief SysTick active state (`SCB_SHCSR.SYSTICKACT`) bit position @def SCB_SHCSR_SYSTICKACT_Pos */
#define SCB_SHCSR_SYSTICKACT_Pos		((reg_bit_pos_t) 11U)
/** @brief SysTick active state (`SCB_SHCSR.SYSTICKACT`) bit mask @def SCB_SHCSR_SYSTICKACT_Msk */
#define SCB_SHCSR_SYSTICKACT_Msk		REG_BIT_MASK(SCB_SHCSR_SYSTICKACT_Pos)
/** @brief SysTick active state (`SCB_SHCSR.SYSTICKACT`) bit mask alias @def SCB_SHCSR_SYSTICKACT */
#define SCB_SHCSR_SYSTICKACT			SCB_SHCSR_SYSTICKACT_Msk

/** @brief UsageFault pending state (`SCB_SHCSR.USGFAULTPENDED`) bit position @def SCB_SHCSR_USGFAULTPENDED_Pos */
#define SCB_SHCSR_USGFAULTPENDED_Pos		((reg_bit_pos_t) 12U)
/** @brief UsageFault pending state (`SCB_SHCSR.USGFAULTPENDED`) bit mask @def SCB_SHCSR_USGFAULTPENDED_Msk */
#define SCB_SHCSR_USGFAULTPENDED_Msk		REG_BIT_MASK(SCB_SHCSR_USGFAULTPENDED_Pos)
/** @brief UsageFault pending state (`SCB_SHCSR.USGFAULTPENDED`) bit mask alias @def SCB_SHCSR_USGFAULTPENDED */
#define SCB_SHCSR_USGFAULTPENDED		SCB_SHCSR_USGFAULTPENDED_Msk

/** @brief MemManage fault pending state (`SCB_SHCSR.MEMFAULTPENDED`) bit position @def SCB_SHCSR_MEMFAULTPENDED_Pos */
#define SCB_SHCSR_MEMFAULTPENDED_Pos		((reg_bit_pos_t) 13U)
/** @brief MemManage fault pending state (`SCB_SHCSR.MEMFAULTPENDED`) bit mask @def SCB_SHCSR_MEMFAULTPENDED_Msk */
#define SCB_SHCSR_MEMFAULTPENDED_Msk		REG_BIT_MASK(SCB_SHCSR_MEMFAULTPENDED_Pos)
/** @brief MemManage fault pending state (`SCB_SHCSR.MEMFAULTPENDED`) bit mask alias @def SCB_SHCSR_MEMFAULTPENDED */
#define SCB_SHCSR_MEMFAULTPENDED		SCB_SHCSR_MEMFAULTPENDED_Msk

