GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Core/Inc/stm32f1xx_scb.h
/** @brief BusFault pending state (`SCB_SHCSR.BUSFAULTPENDED`) bit position @def SCB_SHCSR_BUSFAULTPENDED_Pos */
#define SCB_SHCSR_BUSFAULTPENDED_Pos		((reg_bit_pos_t) 14U)
/** @brief BusFault pending state (`SCB_SHCSR.BUSFAULTPENDED`) bit mask @def SCB_SHCSR_BUSFAULTPENDED_Msk */
#define SCB_SHCSR_BUSFAULTPENDED_Msk		REG_BIT_MASK(SCB_SHCSR_BUSFAULTPENDED_Pos)
/** @brief BusFault pending state (`SCB_SHCSR.BUSFAULTPENDED`) bit mask alias @def SCB_SHCSR_BUSFAULTPENDED */
#define SCB_SHCSR_BUSFAULTPENDED		SCB_SHCSR_BUSFAULTPENDED_Msk

/** @brief SVCall pending state (`SCB_SHCSR.SVCALLPENDED`) bit position @def SCB_SHCSR_SVCALLPENDED_Pos */
#define SCB_SHCSR_SVCALLPENDED_Pos		((reg_bit_pos_t) 15U)
/** @brief SVCall pending state (`SCB_SHCSR.SVCALLPENDED`) bit mask @def SCB_SHCSR_SVCALLPENDED_Msk */
#define SCB_SHCSR_SVCALLPENDED_Msk		REG_BIT_MASK(SCB_SHCSR_SVCALLPENDED_Pos)
/** @brief SVCall pending state (`SCB_SHCSR.SVCALLPENDED`) bit mask alias @def SCB_SHCSR_SVCALLPENDED */
#define SCB_SHCSR_SVCALLPENDED			SCB_SHCSR_SVCALLPENDED_Msk

/** @brief MemManage fault enable (`SCB_SHCSR.MEMFAULTENA`) bit position @def SCB_SHCSR_MEMFAULTENA_Pos */
#define SCB_SHCSR_MEMFAULTENA_Pos		((reg_bit_pos_t) 16U)
/** @brief MemManage fault enable (`SCB_SHCSR.MEMFAULTENA`) bit mask @def SCB_SHCSR_MEMFAULTENA_Msk */
#define SCB_SHCSR_MEMFAULTENA_Msk		REG_BIT_MASK(SCB_SHCSR_MEMFAULTENA_Pos)
/** @brief MemManage fault enable (`SCB_SHCSR.MEMFAULTENA`) bit mask alias @def SCB_SHCSR_MEMFAULTENA */
#define SCB_SHCSR_MEMFAULTENA			SCB_SHCSR_MEMFAULTENA_Msk

/** @brief BusFault enable (`SCB_SHCSR.BUSFAULTENA`) bit position @def SCB_SHCSR_BUSFAULTENA_Pos */
#define SCB_SHCSR_BUSFAULTENA_Pos		((reg_bit_pos_t) 17U)
/** @brief BusFault enable (`SCB_SHCSR.BUSFAULTENA`) bit mask @def SCB_SHCSR_BUSFAULTENA_Msk */
#define SCB_SHCSR_BUSFAULTENA_Msk		REG_BIT_MASK(SCB_SHCSR_BUSFAULTENA_Pos)
/** @brief BusFault enable (`SCB_SHCSR.BUSFAULTENA`) bit mask alias @def SCB_SHCSR_BUSFAULTENA */
#define SCB_SHCSR_BUSFAULTENA			SCB_SHCSR_BUSFAULTENA_Msk

/** @brief UsageFault enable (`SCB_SHCSR.USGFAULTENA`) bit position @def SCB_SHCSR_USGFAULTENA_Pos */
#define SCB_SHCSR_USGFAULTENA_Pos		((reg_bit_pos_t) 18U)
/** @brief UsageFault enable (`SCB_SHCSR.USGFAULTENA`) bit mask @def SCB_SHCSR_USGFAULTENA_Msk */
#define SCB_SHCSR_USGFAULTENA_Msk		REG_BIT_MASK(SCB_SHCSR_USGFAULTENA_Pos)
/** @brief UsageFault enable (`SCB_SHCSR.USGFAULTENA`) bit mask alias @def SCB_SHCSR_USGFAULTENA */
#define SCB_SHCSR_USGFAULTENA			SCB_SHCSR_USGFAULTENA_Msk

// ---------------------------------------------------------------------------------------------------- //
//											SCB_CFSR											//
// ---------------------------------------------------------------------------------------------------- //
/** @brief MemManage Fault Status subregister (`SCB_CFSR.MEMFAULTSR[7:0]`) field position @def SCB_CFSR_MEMFAULTSR_Pos */
#define SCB_CFSR_MEMFAULTSR_Pos			((reg_bit_pos_t) 0U)
/** @brief MemManage Fault Status subregister (`SCB_CFSR.MEMFAULTSR[7:0]`) field width @def SCB_CFSR_MEMFAULTSR_Width */
#define SCB_CFSR_MEMFAULTSR_Width		((reg_field_width_t) 8U)
/** @brief MemManage Fault Status subregister (`SCB_CFSR.MEMFAULTSR[7:0]`) field mask @def SCB_CFSR_MEMFAULTSR_Msk */
#define SCB_CFSR_MEMFAULTSR_Msk			REG_FIELD_MASK(SCB_CFSR_MEMFAULTSR_Pos, SCB_CFSR_MEMFAULTSR_Width)
/** @brief MemManage Fault Status subregister (`SCB_CFSR.MEMFAULTSR[7:0]`) field mask alias @def SCB_CFSR_MEMFAULTSR */
#define SCB_CFSR_MEMFAULTSR			SCB_CFSR_MEMFAULTSR_Msk

/** @brief Instruction access violation status (`SCB_CFSR.IACCVIOL`) bit position @def SCB_CFSR_IACCVIOL_Pos */
#define SCB_CFSR_IACCVIOL_Pos			((reg_bit_pos_t) 0U)
/** @brief Instruction access violation status (`SCB_CFSR.IACCVIOL`) bit mask @def SCB_CFSR_IACCVIOL_Msk */
#define SCB_CFSR_IACCVIOL_Msk			REG_BIT_MASK(SCB_CFSR_IACCVIOL_Pos)
/** @brief Instruction access violation status (`SCB_CFSR.IACCVIOL`) bit mask alias @def SCB_CFSR_IACCVIOL */
#define SCB_CFSR_IACCVIOL			SCB_CFSR_IACCVIOL_Msk

/** @brief Data access violation status (`SCB_CFSR.DACCVIOL`) bit position @def SCB_CFSR_DACCVIOL_Pos */
#define SCB_CFSR_DACCVIOL_Pos			((reg_bit_pos_t) 1U)
/** @brief Data access violation status (`SCB_CFSR.DACCVIOL`) bit mask @def SCB_CFSR_DACCVIOL_Msk */
#define SCB_CFSR_DACCVIOL_Msk			REG_BIT_MASK(SCB_CFSR_DACCVIOL_Pos)
/** @brief Data access violation status (`SCB_CFSR.DACCVIOL`) bit mask alias @def SCB_CFSR_DACCVIOL */
#define SCB_CFSR_DACCVIOL			SCB_CFSR_DACCVIOL_Msk

/** @brief MemManage unstacking error status (`SCB_CFSR.MUNSTKERR`) bit position @def SCB_CFSR_MUNSTKERR_Pos */
#define SCB_CFSR_MUNSTKERR_Pos			((reg_bit_pos_t) 3U)
/** @brief MemManage unstacking error status (`SCB_CFSR.MUNSTKERR`) bit mask @def SCB_CFSR_MUNSTKERR_Msk */
#define SCB_CFSR_MUNSTKERR_Msk			REG_BIT_MASK(SCB_CFSR_MUNSTKERR_Pos)
/** @brief MemManage unstacking error status (`SCB_CFSR.MUNSTKERR`) bit mask alias @def SCB_CFSR_MUNSTKERR */
#define SCB_CFSR_MUNSTKERR			SCB_CFSR_MUNSTKERR_Msk

/** @brief MemManage stacking error status (`SCB_CFSR.MSTKERR`) bit position @def SCB_CFSR_MSTKERR_Pos */
#define SCB_CFSR_MSTKERR_Pos			((reg_bit_pos_t) 4U)
/** @brief MemManage stacking error status (`SCB_CFSR.MSTKERR`) bit mask @def SCB_CFSR_MSTKERR_Msk */
#define SCB_CFSR_MSTKERR_Msk			REG_BIT_MASK(SCB_CFSR_MSTKERR_Pos)
/** @brief MemManage stacking error status (`SCB_CFSR.MSTKERR`) bit mask alias @def SCB_CFSR_MSTKERR */
#define SCB_CFSR_MSTKERR			SCB_CFSR_MSTKERR_Msk

/** @brief MemManage fault address validity (`SCB_CFSR.MMARVALID`) bit position @def SCB_CFSR_MMARVALID_Pos */
#define SCB_CFSR_MMARVALID_Pos			((reg_bit_pos_t) 7U)
/** @brief MemManage fault address validity (`SCB_CFSR.MMARVALID`) bit mask @def SCB_CFSR_MMARVALID_Msk */
#define SCB_CFSR_MMARVALID_Msk			REG_BIT_MASK(SCB_CFSR_MMARVALID_Pos)
/** @brief MemManage fault address validity (`SCB_CFSR.MMARVALID`) bit mask alias @def SCB_CFSR_MMARVALID */
#define SCB_CFSR_MMARVALID			SCB_CFSR_MMARVALID_Msk

