GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Core/Inc/stm32f1xx_scb.h
/** @brief BusFault Status subregister (`SCB_CFSR.BUSFAULTSR[15:8]`) field position @def SCB_CFSR_BUSFAULTSR_Pos */
#define SCB_CFSR_BUSFAULTSR_Pos			((reg_bit_pos_t) 8U)
/** @brief BusFault Status subregister (`SCB_CFSR.BUSFAULTSR[15:8]`) field width @def SCB_CFSR_BUSFAULTSR_Width */
#define SCB_CFSR_BUSFAULTSR_Width		((reg_field_width_t) 8U)
/** @brief BusFault Status subregister (`SCB_CFSR.BUSFAULTSR[15:8]`) field mask @def SCB_CFSR_BUSFAULTSR_Msk */
#define SCB_CFSR_BUSFAULTSR_Msk			REG_FIELD_MASK(SCB_CFSR_BUSFAULTSR_Pos, SCB_CFSR_BUSFAULTSR_Width)
/** @brief BusFault Status subregister (`SCB_CFSR.BUSFAULTSR[15:8]`) field mask alias @def SCB_CFSR_BUSFAULTSR */
#define SCB_CFSR_BUSFAULTSR			SCB_CFSR_BUSFAULTSR_Msk

/** @brief Instruction bus error status (`SCB_CFSR.IBUSERR`) bit position @def SCB_CFSR_IBUSERR_Pos */
#define SCB_CFSR_IBUSERR_Pos			((reg_bit_pos_t) 8U)
/** @brief Instruction bus error status (`SCB_CFSR.IBUSERR`) bit mask @def SCB_CFSR_IBUSERR_Msk */
#define SCB_CFSR_IBUSERR_Msk			REG_BIT_MASK(SCB_CFSR_IBUSERR_Pos)
/** @brief Instruction bus error status (`SCB_CFSR.IBUSERR`) bit mask alias @def SCB_CFSR_IBUSERR */
#define SCB_CFSR_IBUSERR			SCB_CFSR_IBUSERR_Msk

/** @brief Precise data bus error status (`SCB_CFSR.PRECISERR`) bit position @def SCB_CFSR_PRECISERR_Pos */
#define SCB_CFSR_PRECISERR_Pos			((reg_bit_pos_t) 9U)
/** @brief Precise data bus error status (`SCB_CFSR.PRECISERR`) bit mask @def SCB_CFSR_PRECISERR_Msk */
#define SCB_CFSR_PRECISERR_Msk			REG_BIT_MASK(SCB_CFSR_PRECISERR_Pos)
/** @brief Precise data bus error status (`SCB_CFSR.PRECISERR`) bit mask alias @def SCB_CFSR_PRECISERR */
#define SCB_CFSR_PRECISERR			SCB_CFSR_PRECISERR_Msk

/** @brief Imprecise data bus error status (`SCB_CFSR.IMPRECISERR`) bit position @def SCB_CFSR_IMPRECISERR_Pos */
#define SCB_CFSR_IMPRECISERR_Pos		((reg_bit_pos_t) 10U)
/** @brief Imprecise data bus error status (`SCB_CFSR.IMPRECISERR`) bit mask @def SCB_CFSR_IMPRECISERR_Msk */
#define SCB_CFSR_IMPRECISERR_Msk		REG_BIT_MASK(SCB_CFSR_IMPRECISERR_Pos)
/** @brief Imprecise data bus error status (`SCB_CFSR.IMPRECISERR`) bit mask alias @def SCB_CFSR_IMPRECISERR */
#define SCB_CFSR_IMPRECISERR			SCB_CFSR_IMPRECISERR_Msk

/** @brief BusFault unstacking error status (`SCB_CFSR.UNSTKERR`) bit position @def SCB_CFSR_UNSTKERR_Pos */
#define SCB_CFSR_UNSTKERR_Pos			((reg_bit_pos_t) 11U)
/** @brief BusFault unstacking error status (`SCB_CFSR.UNSTKERR`) bit mask @def SCB_CFSR_UNSTKERR_Msk */
#define SCB_CFSR_UNSTKERR_Msk			REG_BIT_MASK(SCB_CFSR_UNSTKERR_Pos)
/** @brief BusFault unstacking error status (`SCB_CFSR.UNSTKERR`) bit mask alias @def SCB_CFSR_UNSTKERR */
#define SCB_CFSR_UNSTKERR				SCB_CFSR_UNSTKERR_Msk

/** @brief BusFault stacking error status (`SCB_CFSR.STKERR`) bit position @def SCB_CFSR_STKERR_Pos */
#define SCB_CFSR_STKERR_Pos				((reg_bit_pos_t) 12U)
/** @brief BusFault stacking error status (`SCB_CFSR.STKERR`) bit mask @def SCB_CFSR_STKERR_Msk */
#define SCB_CFSR_STKERR_Msk				REG_BIT_MASK(SCB_CFSR_STKERR_Pos)
/** @brief BusFault stacking error status (`SCB_CFSR.STKERR`) bit mask alias @def SCB_CFSR_STKERR */
#define SCB_CFSR_STKERR					SCB_CFSR_STKERR_Msk

/** @brief BusFault address validity (`SCB_CFSR.BFARVALID`) bit position @def SCB_CFSR_BFARVALID_Pos */
#define SCB_CFSR_BFARVALID_Pos			((reg_bit_pos_t) 15U)
/** @brief BusFault address validity (`SCB_CFSR.BFARVALID`) bit mask @def SCB_CFSR_BFARVALID_Msk */
#define SCB_CFSR_BFARVALID_Msk			REG_BIT_MASK(SCB_CFSR_BFARVALID_Pos)
/** @brief BusFault address validity (`SCB_CFSR.BFARVALID`) bit mask alias @def SCB_CFSR_BFARVALID */
#define SCB_CFSR_BFARVALID			SCB_CFSR_BFARVALID_Msk

/** @brief UsageFault Status subregister (`SCB_CFSR.USGFAULTSR[31:16]`) field position @def SCB_CFSR_USGFAULTSR_Pos */
#define SCB_CFSR_USGFAULTSR_Pos			((reg_bit_pos_t) 16U)
/** @brief UsageFault Status subregister (`SCB_CFSR.USGFAULTSR[31:16]`) field width @def SCB_CFSR_USGFAULTSR_Width */
#define SCB_CFSR_USGFAULTSR_Width		((reg_field_width_t) 16U)
/** @brief UsageFault Status subregister (`SCB_CFSR.USGFAULTSR[31:16]`) field mask @def SCB_CFSR_USGFAULTSR_Msk */
#define SCB_CFSR_USGFAULTSR_Msk			REG_FIELD_MASK(SCB_CFSR_USGFAULTSR_Pos, SCB_CFSR_USGFAULTSR_Width)
/** @brief UsageFault Status subregister (`SCB_CFSR.USGFAULTSR[31:16]`) field mask alias @def SCB_CFSR_USGFAULTSR */
#define SCB_CFSR_USGFAULTSR				SCB_CFSR_USGFAULTSR_Msk

/** @brief Undefined-instruction usage fault status (`SCB_CFSR.UNDEFINSTR`) bit position @def SCB_CFSR_UNDEFINSTR_Pos */
#define SCB_CFSR_UNDEFINSTR_Pos			((reg_bit_pos_t) 16U)
/** @brief Undefined-instruction usage fault status (`SCB_CFSR.UNDEFINSTR`) bit mask @def SCB_CFSR_UNDEFINSTR_Msk */
#define SCB_CFSR_UNDEFINSTR_Msk			REG_BIT_MASK(SCB_CFSR_UNDEFINSTR_Pos)
/** @brief Undefined-instruction usage fault status (`SCB_CFSR.UNDEFINSTR`) bit mask alias @def SCB_CFSR_UNDEFINSTR */
#define SCB_CFSR_UNDEFINSTR				SCB_CFSR_UNDEFINSTR_Msk

/** @brief Invalid-state usage fault status (`SCB_CFSR.INVSTATE`) bit position @def SCB_CFSR_INVSTATE_Pos */
#define SCB_CFSR_INVSTATE_Pos			((reg_bit_pos_t) 17U)
/** @brief Invalid-state usage fault status (`SCB_CFSR.INVSTATE`) bit mask @def SCB_CFSR_INVSTATE_Msk */
#define SCB_CFSR_INVSTATE_Msk			REG_BIT_MASK(SCB_CFSR_INVSTATE_Pos)
/** @brief Invalid-state usage fault status (`SCB_CFSR.INVSTATE`) bit mask alias @def SCB_CFSR_INVSTATE */
#define SCB_CFSR_INVSTATE				SCB_CFSR_INVSTATE_Msk

/** @brief Invalid-PC-load usage fault status (`SCB_CFSR.INVPC`) bit position @def SCB_CFSR_INVPC_Pos */
#define SCB_CFSR_INVPC_Pos				((reg_bit_pos_t) 18U)
/** @brief Invalid-PC-load usage fault status (`SCB_CFSR.INVPC`) bit mask @def SCB_CFSR_INVPC_Msk */
#define SCB_CFSR_INVPC_Msk				REG_BIT_MASK(SCB_CFSR_INVPC_Pos)
/** @brief Invalid-PC-load usage fault status (`SCB_CFSR.INVPC`) bit mask alias @def SCB_CFSR_INVPC */
#define SCB_CFSR_INVPC					SCB_CFSR_INVPC_Msk

/** @brief No-coprocessor usage fault status (`SCB_CFSR.NOCP`) bit position @def SCB_CFSR_NOCP_Pos */
#define SCB_CFSR_NOCP_Pos				((reg_bit_pos_t) 19U)
/** @brief No-coprocessor usage fault status (`SCB_CFSR.NOCP`) bit mask @def SCB_CFSR_NOCP_Msk */
#define SCB_CFSR_NOCP_Msk				REG_BIT_MASK(SCB_CFSR_NOCP_Pos)
/** @brief No-coprocessor usage fault status (`SCB_CFSR.NOCP`) bit mask alias @def SCB_CFSR_NOCP */
#define SCB_CFSR_NOCP					SCB_CFSR_NOCP_Msk

/** @brief Unaligned-access usage fault status (`SCB_CFSR.UNALIGNED`) bit position @def SCB_CFSR_UNALIGNED_Pos */
#define SCB_CFSR_UNALIGNED_Pos			((reg_bit_pos_t) 24U)
/** @brief Unaligned-access usage fault status (`SCB_CFSR.UNALIGNED`) bit mask @def SCB_CFSR_UNALIGNED_Msk */
#define SCB_CFSR_UNALIGNED_Msk			REG_BIT_MASK(SCB_CFSR_UNALIGNED_Pos)
/** @brief Unaligned-access usage fault status (`SCB_CFSR.UNALIGNED`) bit mask alias @def SCB_CFSR_UNALIGNED */
#define SCB_CFSR_UNALIGNED			SCB_CFSR_UNALIGNED_Msk

/** @brief Divide-by-zero usage fault status (`SCB_CFSR.DIVBYZERO`) bit position @def SCB_CFSR_DIVBYZERO_Pos */
#define SCB_CFSR_DIVBYZERO_Pos			((reg_bit_pos_t) 25U)
/** @brief Divide-by-zero usage fault status (`SCB_CFSR.DIVBYZERO`) bit mask @def SCB_CFSR_DIVBYZERO_Msk */
#define SCB_CFSR_DIVBYZERO_Msk			REG_BIT_MASK(SCB_CFSR_DIVBYZERO_Pos)
/** @brief Divide-by-zero usage fault status (`SCB_CFSR.DIVBYZERO`) bit mask alias @def SCB_CFSR_DIVBYZERO */
#define SCB_CFSR_DIVBYZERO			SCB_CFSR_DIVBYZERO_Msk

// ---------------------------------------------------------------------------------------------------- //
//											SCB_HFSR											//
// ---------------------------------------------------------------------------------------------------- //
/** @brief Vector-table read HardFault status (`SCB_HFSR.VECTTBL`) bit position @def SCB_HFSR_VECTTBL_Pos */
#define SCB_HFSR_VECTTBL_Pos		((reg_bit_pos_t) 1U)
/** @brief Vector-table read HardFault status (`SCB_HFSR.VECTTBL`) bit mask @def SCB_HFSR_VECTTBL_Msk */
#define SCB_HFSR_VECTTBL_Msk		REG_BIT_MASK(SCB_HFSR_VECTTBL_Pos)
/** @brief Vector-table read HardFault status (`SCB_HFSR.VECTTBL`) bit mask alias @def SCB_HFSR_VECTTBL */
#define SCB_HFSR_VECTTBL		SCB_HFSR_VECTTBL_Msk

